day: 1
operator: where
category: tabular
description: Filters rows based on a condition
covers:
- ==
- '!='
- <
- '>'
- <=
- '>='
- =~
- '!~'
- in
- '!in'
- between
- '!between'
explanation: |
  The where operator filters rows by boolean expressions, each expression will result
  in either true or false. You can use comparison operators (==, !=, <, >, <=, >=) for numeric types and string comparison like regex, has, contains, has_any, has_all. 
  You can also use membership operators (in, !in, between, !between) to check if a value exists within a set or range. Combine multiple conditions using logical operators (and, or, not) to create complex filters.

examples:
  - query: | 
      DeviceProcessEvents
      | where ProcessCommandLine contains "powershell" and TimeGenerated > ago(7d)
    description: >
      Find all process events in the last 7 days where the command line contains "powershell".
  - query: |
      SecurityEvent
      | where EventID in (4624, 4625) and AccountType == "User"
    description: >
      Retrieve security events with EventID 4624 or 4625 for user accounts.
  - query: |
      SecurityEvent
      | where TimeGenerated between (datetime(2026-01-01) .. datetime(2026-01-31))
    description: >
      Get security events that occurred between two times

challenge: |
  Using the DeviceProcessEvents sample dataset answer the following question: 

  How many rows are returned when the DeviceName contains 'castelblack' with an InitiatingProcessParentFileName of 'powershell.exe' where the SID is not "S-1-5-16"? 

  ```
    // ----------------------------
    // DemoDeviceProcessEvents
    // ----------------------------
    let DemoDeviceProcessEvents = externaldata(
        AccountDomain:string,
        AccountName:string,
        AccountObjectId:string,
        AccountSid:string,
        AccountUpn:string,
        ActionType:string,
        AdditionalFields:dynamic,
        AppGuardContainerId:string,
        DeviceId:string,
        DeviceName:string,
        FileName:string,
        FolderPath:string,
        FileSize:long,
        InitiatingProcessAccountDomain:string,
        InitiatingProcessAccountName:string,
        InitiatingProcessAccountObjectId:string,
        InitiatingProcessAccountSid:string,
        InitiatingProcessAccountUpn:string,
        InitiatingProcessCommandLine:string,
        InitiatingProcessFileName:string,
        InitiatingProcessFolderPath:string,
        InitiatingProcessId:long,
        InitiatingProcessIntegrityLevel:string,
        InitiatingProcessLogonId:long,
        InitiatingProcessMD5:string,
        InitiatingProcessParentFileName:string,
        InitiatingProcessParentId:long,
        InitiatingProcessSHA1:string,
        InitiatingProcessSHA256:string,
        InitiatingProcessTokenElevation:string,
        InitiatingProcessFileSize:long,
        InitiatingProcessVersionInfoCompanyName:string,
        InitiatingProcessVersionInfoProductName:string,
        InitiatingProcessVersionInfoProductVersion:string,
        InitiatingProcessVersionInfoInternalFileName:string,
        InitiatingProcessVersionInfoOriginalFileName:string,
        InitiatingProcessVersionInfoFileDescription:string,
        LogonId:long,
        MD5:string,
        MachineGroup:string,
        ProcessCommandLine:string,
        ProcessCreationTime:datetime,
        ProcessId:long,
        ProcessIntegrityLevel:string,
        ProcessTokenElevation:string,
        ProcessVersionInfoCompanyName:string,
        ProcessVersionInfoProductName:string,
        ProcessVersionInfoProductVersion:string,
        ProcessVersionInfoInternalFileName:string,
        ProcessVersionInfoOriginalFileName:string,
        ProcessVersionInfoFileDescription:string,
        InitiatingProcessSignerType:string,
        InitiatingProcessSignatureStatus:string,
        ReportId:long,
        SHA1:string,
        SHA256:string,
        TimeGenerated:datetime,
        Timestamp:datetime,
        InitiatingProcessParentCreationTime:datetime,
        InitiatingProcessCreationTime:datetime,
        CreatedProcessSessionId:long,
        IsProcessRemoteSession:bool,
        ProcessRemoteSessionDeviceName:string,
        ProcessRemoteSessionIP:string,
        InitiatingProcessSessionId:long,
        IsInitiatingProcessRemoteSession:bool,
        InitiatingProcessRemoteSessionDeviceName:string,
        InitiatingProcessRemoteSessionIP:string,
        InitiatingProcessUniqueId:string,
        ProcessUniqueId:string,
        SourceSystem:string,
        Type:string
    )
    ["https://raw.githubusercontent.com/tom564/100_days_kql_2026/refs/heads/main/Datasets/DemoDeviceProcessEvents.csv.gz"]
    with(format="csv", ignoreFirstRecord=true);
  ```

answer: |
  // Run this KQL replacing <Your Answer Here> with your answer to validate, 
  let answer = "<Your Answer Here>";
  let repo = "tom564";
  let answer_hash = "d41282223fdf8619c6da2a8f540f62bae412a2953c5b74acac1ec9d2f93b7ac7";
  let attempt = hash_sha256(strcat(answer, repo));
  print iff(attempt == answer_hash, "Correct", "Incorrect")