day: 3
operator: extend
category: tabular
description: Adds calculated columns
explanation: |
  extend adds computed columns while preserving existing ones. These fields may come from extraction, transformation, or other calculations.
  Use extend for derived fields that will be used later in the query pipeline.
examples:
  - query: | 
      DeviceProcessEvents
      | extend IsPowerShell = iff(ProcessCommandLine contains "powershell", true, false)
    description: >
      Adds a new column IsPowerShell that indicates whether the ProcessCommandLine contains "powershell".
  - query: | 
      DeviceNetworkEvents
      | extend HourOfDay = datetime_part("hour", TimeGenerated)
    description: >
      Adds a new column HourOfDay that extracts the hour from the TimeGenerated timestamp.
  - query: | 
      SecurityEvent
      | extend AccountDomainUpper = toupper(AccountDomain)
    description: >
      Adds a new column AccountDomainUpper that contains the uppercase version of the AccountDomain.

challenge: |
  Using the DeviceProcessEvents sample dataset answer the following question:

  Where ReportId is 1073545, extend a column to contain the sha256 hash of ProcessCommandLine and use this as the answer.

  ```
      // ----------------------------
    // DemoDeviceProcessEvents
    // ----------------------------
    let DemoDeviceProcessEvents = externaldata(
        AccountDomain:string,
        AccountName:string,
        AccountObjectId:string,
        AccountSid:string,
        AccountUpn:string,
        ActionType:string,
        AdditionalFields:dynamic,
        AppGuardContainerId:string,
        DeviceId:string,
        DeviceName:string,
        FileName:string,
        FolderPath:string,
        FileSize:long,
        InitiatingProcessAccountDomain:string,
        InitiatingProcessAccountName:string,
        InitiatingProcessAccountObjectId:string,
        InitiatingProcessAccountSid:string,
        InitiatingProcessAccountUpn:string,
        InitiatingProcessCommandLine:string,
        InitiatingProcessFileName:string,
        InitiatingProcessFolderPath:string,
        InitiatingProcessId:long,
        InitiatingProcessIntegrityLevel:string,
        InitiatingProcessLogonId:long,
        InitiatingProcessMD5:string,
        InitiatingProcessParentFileName:string,
        InitiatingProcessParentId:long,
        InitiatingProcessSHA1:string,
        InitiatingProcessSHA256:string,
        InitiatingProcessTokenElevation:string,
        InitiatingProcessFileSize:long,
        InitiatingProcessVersionInfoCompanyName:string,
        InitiatingProcessVersionInfoProductName:string,
        InitiatingProcessVersionInfoProductVersion:string,
        InitiatingProcessVersionInfoInternalFileName:string,
        InitiatingProcessVersionInfoOriginalFileName:string,
        InitiatingProcessVersionInfoFileDescription:string,
        LogonId:long,
        MD5:string,
        MachineGroup:string,
        ProcessCommandLine:string,
        ProcessCreationTime:datetime,
        ProcessId:long,
        ProcessIntegrityLevel:string,
        ProcessTokenElevation:string,
        ProcessVersionInfoCompanyName:string,
        ProcessVersionInfoProductName:string,
        ProcessVersionInfoProductVersion:string,
        ProcessVersionInfoInternalFileName:string,
        ProcessVersionInfoOriginalFileName:string,
        ProcessVersionInfoFileDescription:string,
        InitiatingProcessSignerType:string,
        InitiatingProcessSignatureStatus:string,
        ReportId:long,
        SHA1:string,
        SHA256:string,
        TimeGenerated:datetime,
        Timestamp:datetime,
        InitiatingProcessParentCreationTime:datetime,
        InitiatingProcessCreationTime:datetime,
        CreatedProcessSessionId:long,
        IsProcessRemoteSession:bool,
        ProcessRemoteSessionDeviceName:string,
        ProcessRemoteSessionIP:string,
        InitiatingProcessSessionId:long,
        IsInitiatingProcessRemoteSession:bool,
        InitiatingProcessRemoteSessionDeviceName:string,
        InitiatingProcessRemoteSessionIP:string,
        InitiatingProcessUniqueId:string,
        ProcessUniqueId:string,
        SourceSystem:string,
        Type:string
    )
    ["https://raw.githubusercontent.com/tom564/100_days_kql_2026/refs/heads/main/Datasets/DemoDeviceProcessEvents.csv.gz"]
    with(format="csv", ignoreFirstRecord=true);
    DemoDeviceProcessEvents
    | where ReportId == 1073545
    ```


answer: |
  // Run this KQL replacing <Your Answer Here> with your answer to validate, 
  let answer = "<Your Answer Here>";
  let repo = "tom564";
  let answer_hash = "2ab42e25596fe0ea7c7f9a7bf0476d0408735034f2a2c5aff2aa1f7769c2884f";
  let attempt = hash_sha256(strcat(answer, repo));
  print iff(attempt == answer_hash, "Correct", "Incorrect")